/*************************************************
**************************************************
** Практическая работа № 4                      **
** Вариант № 17                                 **
** Определить количество локальных минимумов в 	**
** заданном числовом массиве   		            **
**                                              **
** Выполнил: студент 3 курса ЕПК гр. И-32       **
** Самсыка Р.                                   **
**                                              **
** Проверил: преподаватель специальных дисциплин**
** Фомин А. Т.                                  **
**************************************************
*************************************************/

#include <iostream>
#include <vector>
#include "Head.h"

using namespace std;

int main()
{
    vector<int> v (20);
    v = MasIn(v);
    cout<<"Массив: ";
    Out(v);
    LocalMin(v);
}
